/**
* <p><b> Лабораторна робота №4 "Інтерактивні консольні програми для платформи Java SE"</b>
* </p><br/>
* <p><b><i> Мета роботи: </i></b>
* <ul>
* <li>Розробка інтерактивних консольних програм мовою Java.</li>
* <li>Реалізація діалогового режиму роботи з користувачем в консольних програмах.</li></ul></p>
* <p><b> Завдання/Вимоги: </b><br/>
* <ol>
* <li>Використовуючи програму рішення завдання лабораторної роботи №3,
* відповідно до прикладної задачі забезпечити обробку команд користувача
* у вигляді текстового меню:
* <ul>
* <li>введення даних;</li>
* <li>перегляд даних;</li>
* <li>виконання обчислень;</li>
* <li>відображення результату;</li>
* <li>завершення програми і т.д.</li>
* </ul>
* <li>Забезпечити обробку параметрів командного рядка для визначення
* режиму роботи програми:</li>
* <ul>
* <li>параметр "-h" чи "-help": відображається інформація про автора програми,
* призначення (індивідуальне завдання), детальний опис режимів роботи
* (пунктів меню та параметрів командного рядка);</li>
* <li>параметр "-d" чи "-debug": в процесі роботи програми відображаються
* додаткові дані, що полегшують налагодження та перевірку працездатності
* програми: діагностичні повідомлення, проміжні значення змінних, значення
* тимчасових змінних та ін.</li>
* </ul>
* </ol></p>
* 
* @author student Lytvyn I.I. KIT-26A
* @date 06-Sep-2017
*/

package ua.khpi.oop.lytvyn04;