/**
* <p><b> Лабораторна робота №3 "Утилітарні класи. Обробка масивів і рядків"</b>
* </p><br/>
* <p><b><i> Мета роботи: </i></b>
* <ul>
* <li>Розробка власних утилітарних класів.</li>
* <li>Набуття навичок вирішення прикладних задач з використанням масивів і рядків.</li></ul></p>
* <p><b> Завдання: </b><br/>
* <li>Ввести текст. Визначити та вивести, яких літер (голосних чи приголосних)
* більше в кожному реченні тексту. Результат вивести у вигляді таблиці.</p>
* <p><b>Вимоги:</b><br/>
* <ul>
* <li>Розробити та продемонструвати консольну програму мовою Java в середовищі
* Eclipse для вирішення прикладної задачі за номером, що відповідає
* збільшеному на одиницю залишку від ділення на 15 зменшеного на одиницю номера
* студента в журналі групи.</li>
* <li>При вирішенні прикладних задач використовувати латинку.</li>
* <li>Продемонструвати використання об'єктів класу StringBuilder або StringBuffer.</li>
* <li>Для обробки даних використовувати класи-утиліти.</li>
* <li>Забороняється використовувати засоби обробки регулярних виразів.</li></ul></p>
* 
* @author student Lytvyn I.I. KIT-26A
* @date 06-Sep-2017
*/

package ua.khpi.oop.lytvyn03;