/**
 * <p>
 * <b> Лабораторна робота №11 "Регулярні вирази. Перевірка даних"</b>
 * </p>
 * <b><i> Мета роботи: </i></b><br>
 * Ознайомлення з принципами використання регулярних виразів для перевірки рядка
 * на відповідність шаблону.<br>
 * <br>
 * <b> Завдання/Вимоги: </b><br>
 * Продемонструвати ефективне (оптимальне) використання регулярних виразів для
 * перевірки коректності (валідації) даних, що вводяться, перед записом в
 * domain-об’єкти відповідно до призначення кожного поля для заповнення
 * розробленого контейнера:
 * <ul>
 * <li>при зчитуванні даних з текстового файла в автоматичному режимі;</li>
 * <li>при введенні даних користувачем в діалоговому режимі.</li>
 * </ul>
 * <b>Прикладна задача:</b><br>
 * <i>Бюро знайомств. Запис про клієнта: стать; реєстраційний номер; дата
 * реєстрації; відомості про себе (довільний набір властивостей: ім’я, зріст,
 * колір очей, дата народження, хобі тощо); вимоги до партнера (довільний набір
 * властивостей).</i><br>
 * <br>
 * 
 * @author student Lytvyn I.I. KIT-26A
 */

package ua.khpi.oop.lytvyn11;