/**
 * <p>
 * <b> Лабораторна робота №6 "Серіалізація/десеріалізація об’єктів. Бібліотека
 * класів користувача"</b>
 * </p>
 * <b><i> Мета роботи: </i></b>
 * <ul>
 * <li>Тривале зберігання та відновлення стану об’єктів.</li>
 * <li>Ознайомлення з принципами серіалізації/десеріалізації об’єктів.</li>
 * <li>Використання бібліотек класів користувача.</li>
 * </ul>
 * <b> Завдання/Вимоги: </b><br>
 * <ol>
 * <li>Реалізувати і продемонструвати тривале зберігання/відновлення раніше
 * розробленого контейнера за допомогою серіалізації/десеріалізації.</li>
 * <li>Обмінятися відкомпільованим (без початкового коду) службовим класом
 * (Utility Class) рішення задачі л.р. №3 з іншим студентом (визначає викладач).
 * </li>
 * <li>Продемонструвати послідовну та вибіркову обробку елементів розробленого
 * контейнера за допомогою власного і отриманого за обміном службового класу.
 * </li>
 * <li>Реалізувати та продемонструвати порівняння, сортування та пошук елементів
 * у контейнері.</li>
 * <li>Розробити консольну програму та забезпечити діалоговий режим роботи з
 * користувачем для демонстрації та тестування рішення.</li>
 * </ol>
 * 
 * @author student Lytvyn I.I. KIT-26A
 */

package ua.khpi.oop.lytvyn06;