/**
 * <p>
 * <b> Лабораторна робота №7 "Об’єктно-орієнтована декомпозиція"</b>
 * </p>
 * <b><i> Мета роботи: </i></b><br>
 * Використання об’єктно-орієнтованого підходу для розробки об’єкта предметної
 * (прикладної) галузі.<br>
 * <br>
 * <b> Завдання/Вимоги: </b><br>
 * <ol>
 * <li>Використовуючи об’єктно-орієнтований аналіз, реалізувати класи для
 * представлення сутностей відповідно прикладної задачі - domain-об’єктів.</li>
 * <li>Забезпечити та продемонструвати коректне введення та відображення
 * кирилиці.</li>
 * <li>Продемонструвати можливість управління масивом domain-об’єктів.</li>
 * </ol>
 * <b>Прикладна задача:</b><br>
 * <i>Бюро знайомств. Запис про клієнта: стать; реєстраційний номер; дата
 * реєстрації; відомості про себе (довільний набір властивостей: ім’я, зріст,
 * колір очей, дата народження, хобі тощо); вимоги до партнера (довільний набір
 * властивостей).</i><br>
 * <br>
 * 
 * @author student Lytvyn I.I. KIT-26A
 */

package ua.khpi.oop.lytvyn07;