package ua.khpi.oop.malokhvii02.data;

/**
 * Перелік можливих станів завершення операції отримання вхідних даних.
 * Використовується для контролювання стану отримання вхідних даних для
 * контейнера даних.
 *
 * @author malokhvii-ee
 * @version 1.0.0
 * @see DataContainer
 * @see {@link DataContainer#collectData()}
 */
public enum DataCollectionStatus {
    /**
     * Стан, призначений для відмітки операції отримання даних для подальшого
     * продовження наступних подій із збереженням отриманих даних.
     * Використовати, якщо отримано коректні дані.
     */
    CONTINUE,
    /**
     * Стан, призначений для відмітки операції отримання даних для подальшого
     * повторення. Використовувати, якщо вхідні дані не відповідають умові, але
     * необхідно повторити операцію отримання.
     */
    REPEAT,
    /**
     * Стан, призначений для відмітки операції для подальшого завершення.
     * Використовувати, якщо необхідно призупинити обробку циклу подій під час
     * непередбачених випадків.
     */
    FINISH
}
