/**
 * <p>
 * <b> Лабораторна робота №9 "Параметризація в Java"</b>
 * </p>
 * <b><i> Мета роботи: </i></b><br>
 * - Вивчення принципів параметризації в Java.<br>
 * - Розробка параметризованих класів та методів.<br>
 * <br>
 * <b> Завдання/Вимоги: </b><br>
 * <ol>
 * <li>Створити власний клас-контейнер, що параметризується (Generic Type), на
 * основі зв’язних списків для реалізації колекції domain-об’єктів лабораторної
 * роботи №7.</li>
 * <li>Для розроблених класів-контейнерів забезпечити можливість використання їх
 * об’єктів у циклі foreach в якості джерела даних.</li>
 * <li>Забезпечити можливість збереження та відновлення колекції об’єктів:<br>
 * 1) за допомогою стандартної серіалізації;<br>
 * 2) не використовуючи протокол серіалізації.</li>
 * <li>Продемонструвати розроблену функціональність: створення контейнера,
 * додавання елементів, видалення елементів, очищення контейнера, перетворення у
 * масив, перетворення у рядок, перевірку на наявність елементів.</li>
 * <li>Забороняється використання контейнерів (колекцій) з Java Collections
 * Framework.</li>
 * </ol>
 * <b>Прикладна задача:</b><br>
 * <i>Бюро знайомств. Запис про клієнта: стать; реєстраційний номер; дата
 * реєстрації; відомості про себе (довільний набір властивостей: ім’я, зріст,
 * колір очей, дата народження, хобі тощо); вимоги до партнера (довільний набір
 * властивостей).</i><br>
 * <br>
 * 
 * @author student Lytvyn I.I. KIT-26A
 */

package ua.khpi.oop.lytvyn09;