/**
 * <p>
 * <b> Лабораторна робота №12 "Регулярні вирази. Обробка тексту"</b>
 * </p>
 * <b><i> Мета роботи: </i></b><br>
 * Ознайомлення з принципами використання регулярних виразів для обробки
 * тексту.<br>
 * <br>
 * <b> Завдання/Вимоги: </b><br>
 * <ol>
 * <li>Використовуючи програми рішень попередніх задач, продемонструвати
 * ефективне (оптимальне) використання регулярних виразів при вирішенні
 * прикладної задачі.</li>
 * <li>Передбачити можливість незначної зміни умов пошуку.<br>
 * В автоматичному режимі діалог з користувачем відсутній, необхідні данні
 * генеруються, або зчитуються з файлу.</li>
 * <li>Продемонструвати розроблену функціональність в діалоговому та
 * автоматичному режимах.</li>
 * </ol>
 * <b>Прикладна задача:</b><br>
 * <i>Бюро знайомств. Знайти всі комбінації пар із різностатевих партнерів з
 * різницею у віці не більше 5 років для ранкових пробіжок в парках Київського
 * району (може бути вказано в довільній формі у вимогах до партнера).</i><br>
 * <br>
 * 
 * @author student Lytvyn I.I. KIT-26A
 */

package ua.khpi.oop.lytvyn12;