/**
 * <p>
 * <b> Лабораторна робота №10 "Обробка параметризованих контейнерів"</b>
 * </p>
 * <b><i> Мета роботи: </i></b><br>
 * Розширення функціональності параметризованих класів.<br>
 * <br>
 * <b> Завдання/Вимоги: </b><br>
 * <ol>
 * <li>Розробити параметризовані методи (Generic Methods) для обробки колекцій
 * об’єктів згідно прикладної задачі.</li>
 * <li>Продемонструвати розроблену функціональність (створення, управління та
 * обробку власних контейнерів) в діалоговому та автоматичному режимах.<br>
 * Автоматичний режим виконання програми задається параметром командного рядка
 * -auto. Наприклад, java ClassName -auto.<br>
 * В автоматичному режимі діалог з користувачем відсутній, необхідні данні
 * генеруються, або зчитуються з файлу.</li>
 * <li>Забороняється використання алгоритмів з Java Collections Framework.</li>
 * </ol>
 * <b>Прикладна задача:</b><br>
 * <i>Бюро знайомств. Запис про клієнта: стать; реєстраційний номер; дата
 * реєстрації; відомості про себе (довільний набір властивостей: ім’я, зріст,
 * колір очей, дата народження, хобі тощо); вимоги до партнера (довільний набір
 * властивостей).</i><br>
 * <br>
 * 
 * @author student Lytvyn I.I. KIT-26A
 */

package ua.khpi.oop.lytvyn10;