/**
 * <p>
 * <b> Лабораторна робота №15 "Колекції в Java"</b>
 * </p>
 * <b><i> Мета роботи: </i></b><br>
 * Ознайомлення з бібліотекою колекцій Java SE. Використання колекцій для
 * розміщення об’єктів розроблених класів.<br>
 * <br>
 * <b> Завдання/Вимоги: </b><br>
 * <ol>
 * <li>Розробити консольну програму для реалізації завдання обробки даних згідно
 * прикладної області.</li>
 * <li>Для розміщення та обробки даних використовувати контейнери (колекції) і
 * алгоритми з Java Collections Framework.</li>
 * <li>Забезпечити обробку колекції об’єктів: додавання, видалення, пошук,
 * сортування згідно розділу Прикладні задачі л.р. №10.</li>
 * <li>Передбачити можливість довготривалого зберігання даних: 1) за допомогою
 * стандартної серіалізації; 2) не використовуючи протокол серіалізації.</li>
 * <li>Продемонструвати розроблену функціональність в діалоговому та
 * автоматичному режимах за результатом обробки параметрів командного
 * рядка.</li>
 * </ol>
 * <b>Прикладна задача:</b><br>
 * <i>Бюро знайомств. Запис про клієнта: стать; реєстраційний номер; дата
 * реєстрації; відомості про себе (довільний набір властивостей: ім’я, зріст,
 * колір очей, дата народження, хобі тощо); вимоги до партнера (довільний набір
 * властивостей).</i><br>
 * <br>
 * 
 * @author student Lytvyn I.I. KIT-26A
 */

package ua.khpi.oop.lytvyn15;