/**
 * <p>
 * <b> Лабораторна робота №8 "Основи введення/виведення Java SE"</b>
 * </p>
 * <b><i> Мета роботи: </i></b><br>
 * Оволодіння навичками управління введенням/виведенням даних з використанням
 * класів платформи Java SE.<br>
 * <br>
 * <b> Завдання/Вимоги: </b><br>
 * <ol>
 * <li>Забезпечити можливість збереження і відновлення масива об’єктів рішення
 * завдання лабораторної роботи №7.</li>
 * <li>Забороняється використання стандартного протокола серіалізації.</li>
 * <li>Продемонструвати використання моделі Long Term Persistence.</li>
 * <li>Забезпечити діалог з користувачем у вигляді простого текстового
 * меню.</li>
 * <li>При збереженні та відновленні даних забезпечити діалоговий режим вибору
 * директорії з відображенням вмісту і можливістю переміщення по
 * підкаталогах.</li>
 * </ol>
 * <b>Прикладна задача:</b><br>
 * <i>Бюро знайомств. Запис про клієнта: стать; реєстраційний номер; дата
 * реєстрації; відомості про себе (довільний набір властивостей: ім’я, зріст,
 * колір очей, дата народження, хобі тощо); вимоги до партнера (довільний набір
 * властивостей).</i><br>
 * <br>
 * 
 * @author student Lytvyn I.I. KIT-26A
 */

package ua.khpi.oop.lytvyn08;