/**
 * Пакет, містить у собі розв'язок до лабораторної роботи
 * <a href="https://oop-khpi.github.io/#task_02">Консольні програми для
 * платформи Java SE. Прості алгоритми обробки даних.</a>
 * <p>
 * Мета:
 * <p>
 * Розробка простих консольних програм для платформи Java SE.
 * <p>
 * Вимоги:
 * <ol>
 * <li>Розробити та продемонструвати програму мовою Java в середовищі Eclipse
 * для вирішення прикладної задачі за номером, що відповідає збільшеному на
 * одиницю залишку від ділення на 10 зменшеного на одиницю номера студента в
 * журналі групи.</li>
 * <li>Для визначення вхідних даних використовувати генератор псевдовипадкових
 * чисел (java.util.Random) та забезпечити циклічне (принаймні десять ітерацій)
 * знаходження результату рішення прикладної задачі.</li>
 * <li>Забезпечити виведення до консолі відповідних значень вхідних даних та
 * результатів обчислень у вигляді таблиці.</li>
 * <li>Забороняється використання даних типу String та масивів при знаходженні
 * рішення прикладної задачі.</li>
 * <li>Застосувати функціональну (процедурну) декомпозицію і забезпечити рішення
 * прикладної задачі за допомогою відповідних статичних методів.</li>
 * </ol>
 * <p>
 * <b>Приклані задачі</b>
 * <ol>
 * <li>Знайти найбільший спільний дільник двох цілих позитивних чисел.</li>
 * <li>Знайти суму цифр заданого цілого числа.</li>
 * <li>Знайти найбільшу цифру в десятковому запису цілочисельного значення.</li>
 * <li>Знайти позиції всіх найменших цифр в десятковому запису цілочисельного
 * значення.</li>
 * <li>Перевірити, чи є задане число простим (тобто не ділиться без залишку на
 * жодні числа, крім себе і 1).</li>
 * <li>Перевірити чи дорівнює сума перших трьох цифр сумі останніх трьох цифр в
 * десятковому запису 6-значного цілого числа.</li>
 * <li>Перевірити чи рівні значення першої та останньої, а також другої та
 * передостанньої цифри в вісімковому запису 4-значного цілого числа.</li>
 * <li>Знайти суму всіх парних і суму всіх непарних цифр в десятковому запису
 * 8-значного цілого числа.</li>
 * <li>Підрахувати кількість цифр, що відображаються за допомогою латинських
 * букв в шістнадцятковому запису 10-значного цілого числа.</li>
 * <li>Знайти кількість комбінацій 01 та 10 в двійковому запису цілого
 * числа.</li>
 * </ol>
 *
 * @author malokhvii-eduard (malokhvii.ee@gmail.com)
 */
package ua.khpi.oop.malokhvii02;
