/**
* @mainpage
* <p><b> Лабораторна робота №2 "Прості алгоритми. Консольні програми"</b>
* </p><br/><br/>
* <p><b><i> Мета роботи: </i></b> Розробка простих консольних програм
* мовою Java.</p>
* <p><b> Завдання: </b><br/>
* <ul><li>Перевірити, чи є задане число простим (тобто не ділиться без залишку
* на жодні числа, крім себе і 1).</li></ul></p>
* <p><b>Вимоги:</b><br/>
* <ol>
* <li>Розробити та продемонструвати програму мовою Java в середовищі Eclipse
* для вирішення прикладної задачі за номером, що відповідає збільшеному
* на одиницю залишку від ділення на 10 зменшеного на одиницю
* номера студента в журналі групи.</li>
* <li>Для визначення вхідних даних використовувати генератор
* псевдовипадкових чисел (java.util.Random) та забезпечити циклічне
* (принаймні десять ітерацій) знаходження результату рішення
* прикладної задачі.</li>
* <li>Забезпечити виведення до консолі відповідних значень вхідних даних
* та результатів обчислень у вигляді таблиці.</li>
* <li>Забороняється використання даних типу String та масивів
* при знаходженні рішення прикладної задачі.</li>
* <li>Застосувати функціональну (процедурну) декомпозицію і забезпечити
* рішення прикладної задачі за допомогою відповідних
* статичних методів.</li></ol></p>
* 
* @author student Lytvyn I.I. KIT-26A
* @date 09-Sep-2017
*/

package ua.khpi.oop.lytvyn02;