/**
 * <p>
 * <b> Лабораторна робота №14 "Паралельне виконання. Ефективність
 * використання"</b>
 * </p>
 * <b><i> Мета роботи: </i></b><br>
 * Вимірювання часу паралельних та послідовних обчислень. Демонстрація
 * ефективності паралельної обробки.<br>
 * <br>
 * <b> Завдання/Вимоги: </b><br>
 * <ol>
 * <li>Забезпечити вимірювання часу паралельної обробки елементів контейнера за
 * допомогою розроблених раніше методів.</li>
 * <li>Додати до алгоритмів штучну затримку виконання для кожної ітерації циклів
 * поелементної обробки контейнерів, щоб загальний час обробки був декілька
 * секунд.</li>
 * <li>Реалізувати послідовну обробку контейнера за допомогою методів, що
 * використовувались для паралельної обробки та забезпечити вимірювання часу їх
 * роботи.</li>
 * <li>Порівняти час паралельної і послідовної обробки та зробити висновки про
 * ефективність розпаралелювання:</li>
 * <ul>
 * <li>результати вимірювання часу звести в таблицю;</li>
 * <li>обчислити та продемонструвати у скільки разів паралельне виконання швидше
 * послідовного.</li>
 * </ul>
 * </ol>
 * <b>Прикладна задача:</b><br>
 * <i>Бюро знайомств. Запис про клієнта: стать; реєстраційний номер; дата
 * реєстрації; відомості про себе (довільний набір властивостей: ім’я, зріст,
 * колір очей, дата народження, хобі тощо); вимоги до партнера (довільний набір
 * властивостей).</i><br>
 * <br>
 * 
 * @author student Lytvyn I.I. KIT-26A
 */

package ua.khpi.oop.lytvyn14;