/**
 * Пакет, містить у собі класи, команд для використання з інтерактивною
 * оболонкою. Для імплементації власних команд використовувати абстрактну
 * команду, для імплементації декораторів для команд використовувати абстрактний
 * декоратор. Для створення використовувати фабрику, регестрація команд за
 * допомогою статичного блоку ініціалізації.
 *
 * @author malokhvii-ee
 * @version 1.0.0
 * @see Command
 * @see AbstractCommand
 * @see AbstractCommandDecorator
 */

package ua.khpi.oop.malokhvii04.shell.command;
