/**
 * <p>
 * <b>1. Типи даних, літерали, операції і оператори.</b>
 * </p>
 * <p>
 * <b>Мета</b><br/>
 * Ознайомлення з JDK платформи Java SE та середовищем розробки Eclipse IDE.
 * </p>
 * <p>
 * <b>Вимоги</b><br/>
 * <ol>
 * <li>Вирішити три прикладні задачі на мові Java в середовищі Eclipse.</li>
 * <li>Продемонструвати покрокове виконання програми та результати роботи в
 * режимі налагодженняя, не використовуючи виведення до консолі.</li>
 * <li>Виконати компіляцію і запуск програми в командному рядку за допомогою
 * відповідних утиліт JDK.</li>
 * </ol>
 * </p>
 * <p>
 * <b>Прикладні задачі</b><br/>
 * <ol>
 * <li>Обрати тип змінних та встановити за допомогою констант та літералів
 * початкові значення:
 * <ul>
 * <li>число, що відповідає номеру залікової книжки за допомогою
 * шістнадцяткового літералу;</li>
 * <li>число, що відповідає номеру мобільного телефона (починаючи з 380...) за
 * допомогою десяткового літералу;</li>
 * <li>число, яке складається з останніх двох ненульових цифр номера мобільного
 * телефону за допомогою двійкового літералу;</li>
 * <li>число, яке складається з останніх чотирьох ненульових цифр номера
 * мобільного телефону за допомогою вісімкового літералу;</li>
 * <li>визначити збільшене на одиницю значення залишку від ділення на 26
 * зменшеного на одиницю номера студента в журналі групи;</li>
 * <li>символ англійського алфавіту в верхньому регістрі, номер якого відповідає
 * знайденому раніше значенню;</li>
 * </ul>
 * </li>
 * <li>Використовуючи десятковий запис цілочисельного значення кожної змінної
 * знайти і підрахувати кількість парних і непарних цифр.</li>
 * <li>Використовуючи двійковий запис цілочисельного значення кожної змінної
 * підрахувати кількість одиниць.</li>
 * </ol>
 * </p>
 */

package ua.khpi.oop.malokhvii01;
