/**
 * Пакет, містить у собі класи, команд для використання з інтерактивною
 * оболонкою. Для імплементації власних команд використовувати абстрактну
 * команду, для імплементації декораторів для команд використовувати абстрактний
 * декоратор. У пакеті визначені деякі базові команди необхідні для роботи
 * інтерактивної оболонки.
 *
 * @author malokhvii-eduard (malokhvii.ee@gmail.com)
 * @see Command
 * @see AbstractCommand
 * @see AbstractCommandDecorator
 */
package ua.khpi.oop.malokhvii04.shell.commands;
